backend: tensorflow
class_name: Sequential
config:
- class_name: InputLayer
  config:
    batch_input_shape: !!python/tuple [null, 1000, 1, 1]
    dtype: float32
    name: input_1
    sparse: false
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: &id001 !!python/tuple [1, 1]
    filters: 5
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [4, 1]
    name: conv2d_1
    padding: same
    strides: &id002 !!python/tuple [1, 1]
    trainable: true
    use_bias: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    filters: 8
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [4, 1]
    name: conv2d_2
    padding: same
    strides: *id002
    trainable: true
    use_bias: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    filters: 8
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [4, 1]
    name: conv2d_3
    padding: same
    strides: *id002
    trainable: true
    use_bias: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_last
    dilation_rate: *id001
    filters: 1
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [1, 1]
    name: conv2d_4
    padding: same
    strides: *id002
    trainable: true
    use_bias: true
keras_version: 2.1.6
